#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.google_client_config.default: Refreshing state... [id=projects//regions//zones/]
google_service_account.sa-tfexc: Refreshing state... [id=projects/gh-actions-321300/serviceAccounts/sa-tfexec@gh-actions-321300.iam.gserviceaccount.com]
data.google_service_account_access_token.sa: Refreshing state... [id=projects/-/serviceAccounts/sa-tfexec@gh-actions-321300.iam.gserviceaccount.com]
google_project_iam_member.sa-tcexec-role["roles/editor"]: Refreshing state... [id=gh-actions-321300/roles/editor/serviceAccount:sa-tfexec@gh-actions-321300.iam.gserviceaccount.com]
google_service_account_iam_member.sa-tfexec-member["serviceAccount:sa-tf-monyama@gh-actions-321300.iam.gserviceaccount.com"]: Refreshing state... [id=projects/gh-actions-321300/serviceAccounts/sa-tfexec@gh-actions-321300.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:sa-tf-monyama@gh-actions-321300.iam.gserviceaccount.com]
google_service_account_iam_member.sa-tfexec-member["user:mamoot@monyama.click"]: Refreshing state... [id=projects/gh-actions-321300/serviceAccounts/sa-tfexec@gh-actions-321300.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/user:mamoot@monyama.click]
google_project_iam_member.my-minimum-role["roles/iam.serviceAccountUser"]: Refreshing state... [id=gh-actions-321300/roles/iam.serviceAccountUser/user:mamoot@monyama.click]
google_compute_network.runner-vpc: Refreshing state... [id=projects/gh-actions-321300/global/networks/runner-vpc]
google_project_iam_member.my-minimum-role["roles/viewer"]: Refreshing state... [id=gh-actions-321300/roles/viewer/user:mamoot@monyama.click]
google_project_service.enable-services["storage-component.googleapis.com"]: Refreshing state... [id=gh-actions-321300/storage-component.googleapis.com]
google_project_service.enable-services["servicenetworking.googleapis.com"]: Refreshing state... [id=gh-actions-321300/servicenetworking.googleapis.com]
google_project_service.enable-services["monitoring.googleapis.com"]: Refreshing state... [id=gh-actions-321300/monitoring.googleapis.com]
google_project_iam_member.my-minimum-role["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=gh-actions-321300/roles/serviceusage.serviceUsageConsumer/user:mamoot@monyama.click]
google_project_service.enable-services["cloudbuild.googleapis.com"]: Refreshing state... [id=gh-actions-321300/cloudbuild.googleapis.com]
google_project_service.enable-services["iam.googleapis.com"]: Refreshing state... [id=gh-actions-321300/iam.googleapis.com]
google_project_service.enable-services["serviceusage.googleapis.com"]: Refreshing state... [id=gh-actions-321300/serviceusage.googleapis.com]
google_project_service.enable-services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=gh-actions-321300/cloudresourcemanager.googleapis.com]
google_project_service.enable-services["container.googleapis.com"]: Refreshing state... [id=gh-actions-321300/container.googleapis.com]
google_project_service.enable-services["compute.googleapis.com"]: Refreshing state... [id=gh-actions-321300/compute.googleapis.com]
google_project_service.enable-services["logging.googleapis.com"]: Refreshing state... [id=gh-actions-321300/logging.googleapis.com]
google_compute_subnetwork.runner-subnet: Refreshing state... [id=projects/gh-actions-321300/regions/us-west1/subnetworks/runner-subnet]
google_project_service.enable-services["secretmanager.googleapis.com"]: Refreshing state... [id=gh-actions-321300/secretmanager.googleapis.com]
google_compute_instance.gce-runner: Refreshing state... [id=projects/gh-actions-321300/zones/us-west1-b/instances/gce-runner]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.test will be created
  + resource "google_storage_bucket" "test" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-WEST1"
      + name                        = "my-project-id-test-bucket"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


Error releasing the state lock!

Error message: googleapi: Error 403: sa-tf-monyama@gh-actions-321300.iam.gserviceaccount.com does not have storage.objects.delete access to the Google Cloud Storage object., forbidden
Lock Info:
  ID:        1628641392555728
  Path:      gs://actions-tfstate/terraform/state/default.tflock
  Operation: OperationTypePlan
  Who:       root@gce-runner
  Version:   0.13.6
  Created:   2021-08-11 00:23:12.451826728 +0000 UTC
  Info:      


Terraform acquires a lock when accessing your state to prevent others
running Terraform to potentially modify the state at the same time. An
error occurred while releasing this lock. This could mean that the lock
did or did not release properly. If the lock didn't release properly,
Terraform may not be able to run future commands since it'll appear as if
the lock is held.

In this scenario, please call the "force-unlock" command to unlock the
state manually. This is a very dangerous operation since if it is done
erroneously it could result in two people modifying state at the same time.
Only call this command if you're certain that the unlock above failed and
that no one else is holding a lock.


```

</details>

*Pusher: @mhiroe, Action: `pull_request`*